# In class exercises1: Queries on a single table

In [1]:
# %load_ext isqlite3
# %sql_open auto_dealership_database.db

import sqlite3
con = sqlite3.connect("auto_dealership_database.db")
cur = con.cursor()

# 1.Select the name and the department for all the employees

cur.execute("SELECT name, department FROM Employees")
name_department_employees = cur.fetchall()

print(name_department_employees)

# cur.close()
# con.close()

[('Erik', 'Sales'), ('Sue', 'Admin'), ('Linda', 'Admin'), ('Anne', 'Service'), ('Mary', 'Service'), ('Tom', 'Sales'), ('John', 'Sales'), ('Joe', 'Sales'), ('Sofia', 'Sales'), ('Marie', 'Admin'), ('Bob', 'Sales'), ('Fred', 'Sales'), ('Sara', 'Sales'), ('Linda', 'Sales'), ('Anne', 'Service'), ('Karl', 'Sales'), ('Sally', 'Service'), ('Tom', 'Admin'), ('Sara', 'Service'), ('Jane', 'Service'), ('Eli', 'Sales'), ('John', 'Service'), ('Chris', 'Sales'), ('Nora', 'Sales'), ('Mary', 'Sales'), ('Fredrik', 'Service'), ('Ina', 'Sales'), ('Sofia', 'Service')]

In [2]:
# 2.Select all the names of the employees in alphabetical order

import sqlite3
con = sqlite3.connect("auto_dealership_database.db")
cur = con.cursor()

cur.execute("SELECT name FROM Employees ORDER BY name ASC")
names_employee_alphabetical_order = cur.fetchall()

print(names_employee_alphabetical_order)

# cur.close()
# con.close()

[('Anne',), ('Anne',), ('Bob',), ('Chris',), ('Eli',), ('Erik',), ('Fred',), ('Fredrik',), ('Ina',), ('Jane',), ('Joe',), ('John',), ('John',), ('Karl',), ('Linda',), ('Linda',), ('Marie',), ('Mary',), ('Mary',), ('Nora',), ('Sally',), ('Sara',), ('Sara',), ('Sofia',), ('Sofia',), ('Sue',), ('Tom',), ('Tom',)]

In [3]:
# 3.Select all data on employees (from the Employees table) where the salaries are sorted from high to low

import sqlite3
con = sqlite3.connect("auto_dealership_database.db")
cur = con.cursor()

cur.execute("SELECT * FROM Employees ORDER BY salary DESC")
high_to_low_salaries = cur.fetchall()

print(high_to_low_salaries)

# cur.close()
# con.close()

[(21, 'Eli', 176500, 'Master', 'Sales'), (7, 'John', 148200, 'Bachelor', 'Sales'), (8, 'Joe', 148100, 'Master', 'Sales'), (16, 'Karl', 136100, 'Master', 'Sales'), (9, 'Sofia', 117100, 'Bachelor', 'Sales'), (14, 'Linda', 116300, 'Bachelor', 'Sales'), (2, 'Sue', 116200, 'Bachelor', 'Admin'), (1, 'Erik', 114100, 'Bachelor', 'Sales'), (26, 'Fredrik', 105700, 'Master', 'Service'), (25, 'Mary', 104600, 'Master', 'Sales'), (12, 'Fred', 102000, 'High School', 'Sales'), (6, 'Tom', 95900, 'Bachelor', 'Sales'), (5, 'Mary', 89100, 'Bachelor', 'Service'), (17, 'Sally', 84100, 'Bachelor', 'Service'), (27, 'Ina', 81200, 'High School', 'Sales'), (18, 'Tom', 79300, 'High School', 'Admin'), (10, 'Marie', 79000, 'Bachelor', 'Admin'), (24, 'Nora', 77300, 'High School', 'Sales'), (4, 'Anne', 75900, 'Master', 'Service'), (11, 'Bob', 72200, 'High School', 'Sales'), (23, 'Chris', 68800, 'High School', 'Sales'), (3, 'Linda', 67200, 'High School', 'Admin'), (19, 'Sara', 67200, 'High School', 'Service'), (13, 'Sara', 59600, 'High School', 'Sales'), (15, 'Anne', 45600, 'Bachelor', 'Service'), (22, 'John', 44900, 'High School', 'Service'), (20, 'Jane', 42300, 'High School', 'Service'), (28, 'Sofia', 37800, 'High School', 'Service')]

In [5]:
# 4.Use SELECT DISTINCT to select all distinct education levels in the Employees table

import sqlite3
con = sqlite3.connect("auto_dealership_database.db")
cur = con.cursor()

cur.execute("SELECT DISTINCT education FROM Employees")
distinct_education_levels = cur.fetchall()

print(distinct_education_levels)

# cur.close()
# con.close()

[('Bachelor',), ('High School',), ('Master',)]

In [6]:
# 5.Select all the columns in the Cars table for the 10 most expensive cars (highest mrsp)

import sqlite3
con = sqlite3.connect("auto_dealership_database.db")
cur = con.cursor()

cur.execute("SELECT * FROM Cars ORDER BY msrp DESC LIMIT 10")
most_expensive_cars = cur.fetchall()

print(most_expensive_cars)

# cur.close()
# con.close()

[(5066, 'Porsche', 'SUV', 2017, 'Blue', 244900.0, 26), (1068, 'Porsche', 'SUV', 2016, 'Brown', 223400.0, 22), (6501, 'Mercedes', 'Coupe', 2022, 'Purple', 222200.0, 5), (8453, 'Porsche', 'SUV', 2017, 'Black', 222100.0, 4), (8208, 'Porsche', 'Coupe', 2010, 'Blue', 217500.0, 26), (10056, 'Porsche', 'SUV', 2017, 'Yellow', 216800.0, 19), (9195, 'Porsche', 'Coupe', 2017, 'Black', 216400.0, 19), (5250, 'Porsche', 'SUV', 2012, 'Black', 209900.0, 5), (8314, 'Porsche', 'Coupe', 2009, 'Black', 208200.0, 28), (8050, 'Porsche', 'SUV', 2020, 'Blue', 207500.0, 19)]

In [7]:
# 6.Select all the employees working in the Admin department

import sqlite3
con = sqlite3.connect("auto_dealership_database.db")
cur = con.cursor()

cur.execute("SELECT * FROM Employees WHERE department = 'Admin'")
admin_employees = cur.fetchall()

print(admin_employees)

# cur.close()
# con.close()

[(2, 'Sue', 116200, 'Bachelor', 'Admin'), (3, 'Linda', 67200, 'High School', 'Admin'), (10, 'Marie', 79000, 'Bachelor', 'Admin'), (18, 'Tom', 79300, 'High School', 'Admin')]

# In class exercises2 : Queries involving several tables

In [2]:
# %load_ext isqlite3
# %sql_open auto_dealership_database.db

import sqlite3
con = sqlite3.connect("auto_dealership_database.db")
cur = con.cursor()

# 1.Select all the columns from the Cars table together with the price from the Sales table where Sales.car_id = Cars.id

sql_query = """
SELECT Cars.*, Sales.price
FROM Cars
JOIN Sales ON Sales.car_id = Cars.id;
"""

cur.execute(sql_query)
joined_data = cur.fetchall()
# print(joined_data) # Too much data to show the output

# cur.close()
# con.close()

In [7]:
# 2.Create a new column that is the difference between the list_price and the price. You can create a new column as: Sales.list_price - Sales.price AS price_diff

import sqlite3
con = sqlite3.connect("auto_dealership_database.db")
cur = con.cursor()

sql_query = """
SELECT *, Sales.list_price - Sales.price AS price_diff
FROM Sales;
"""

cur.execute(sql_query)
result_data_1 = cur.fetchall()
# print(result_data_1) # Too much data to show the output

# cur.close()
# con.close()

In [6]:
# 3.Create a new column that is the difference between the msrp and the price.

import sqlite3
con = sqlite3.connect("auto_dealership_database.db")
cur = con.cursor()

sql_query = """
SELECT *, Cars.msrp - Sales.price AS price_diff
FROM Cars
JOIN Sales ON Cars.id = Sales.car_id;
"""

cur.execute(sql_query)
result_data_2 = cur.fetchall()
# print(result_data_2) # Too much data to show the output

# cur.close()
# con.close()

In [12]:
# 4.What employee sold the most expensive car?

import sqlite3
con = sqlite3.connect("auto_dealership_database.db")
cur = con.cursor()

sql_query = """
SELECT Employees.name, MAX(Sales.price) AS highest_price
FROM Employees
JOIN Sales ON Employees.id = Sales.employee_id
GROUP BY Employees.id
ORDER BY highest_price DESC
LIMIT 1;
"""
cur.execute(sql_query)
result_data_3 = cur.fetchone() # fetchone() because we only want the first row
print(result_data_3)

# cur.close()
# con.close()

('Bob', 222400.0)

# In class exercises3 : Queries involving grouping and aggregates

In [14]:
# 1. Select the maximum sales price from the Sales table

#################### Jupyter notebook solution ####################

# %load_ext isqlite3
# %sql_open auto_dealership_database.db

# %%sql
# -- Solution 1

# SELECT max(Sales.price) AS max_price
# FROM Sales

#################### Python solution ####################

import sqlite3
con = sqlite3.connect("auto_dealership_database.db")
cur = con.cursor()

sql_query = "SELECT MAX(price) AS max_price FROM Sales;"
cur.execute(sql_query)
result_data_1 = cur.fetchone()
print(result_data_1)

# cur.close()
# con.close()

(222400.0,)

In [15]:
# 2. How many cars are in the Cars table (you can use the function `count(*)`)

#################### Jupyter notebook solution ####################

# %load_ext isqlite3
# %sql_open auto_dealership_database.db

# %%sql
# -- Solution 2

# SELECT count(*) AS total_number_of_cars
# FROM Cars

#################### Python solution ####################

import sqlite3
con = sqlite3.connect("auto_dealership_database.db")
cur = con.cursor()

sql_query = "SELECT COUNT(*) AS total_number_of_cars FROM Cars;"
cur.execute(sql_query)
result_data_2 = cur.fetchone()
print(result_data_2)

# cur.close()
# con.close()

(10148,)

In [16]:
# 3. What is the average price of all the Toyotas sold (try to use `round()` to round the answer)

#################### Juptyer notebook solution ####################

# %load_ext isqlite3
# %sql_open auto_dealership_database.db

# %%sql 
# -- Solution 3

# SELECT Cars.make, round(avg(Sales.price)) AS average_price
# FROM Sales, Cars
# WHERE Sales.car_id = Cars.id
#     AND Cars.make = 'Toyota'

#################### Python solution ####################

import sqlite3
con = sqlite3.connect("auto_dealership_database.db")
cur = con.cursor()

sql_query = """SELECT Cars.make, ROUND(AVG(Sales.price)) AS average_price
               FROM Sales, Cars
               WHERE Sales.car_id = Cars.id AND Cars.make = 'Toyota';"""

cur.execute(sql_query)
result_data_3 = cur.fetchone()
print(result_data_3)

# cur.close()
# con.close()

('Toyota', 20937.0)

In [17]:
# 4. How many cars in the database are from 2006

#################### Juptyer notebook solution ####################

# %load_ext isqlite3
# %sql_open auto_dealership_database.db

# %%sql

# SELECT count(*) AS number_of_cars_in_2006
# FROM Cars
# WHERE Cars.year = 2006


#################### Python solution ####################

import sqlite3
con = sqlite3.connect("auto_dealership_database.db")
cur = con.cursor()

sql_query = "SELECT COUNT(*) AS number_of_cars_in_2006 FROM Cars WHERE Cars.year = 2006;"
cur.execute(sql_query)

result_data_4 = cur.fetchone()

print(result_data_4)

# cur.close()
# con.close()

(591,)